## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/10891725029)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 8 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * github_actions_organization_variable.image_syncer_reader_service_account_email
  * github_actions_organization_variable.image_syncer_writer_service_account_email
  * google_artifact_registry_repository_iam_member.image_syncer_prod_repo_reader
  * google_service_account.image_syncer_reader
  * google_service_account.image_syncer_writer
  * google_service_account_iam_member.image_syncer_reader_workflow_sa_user
  * google_service_account_iam_member.image_syncer_writer_workflow_sa_user
* Update
  * google_service_account.sa_gke_kyma_integration
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner
* Replace
  * google_artifact_registry_repository_iam_member.image_syncer_prod_repo_writer



<details><summary>Change Result (Click me)</summary>

```hcl

  # github_actions_organization_variable.image_syncer_reader_service_account_email will be created
  + resource "github_actions_organization_variable" "image_syncer_reader_service_account_email" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "IMAGE_SYNCER_READER_SERVICE_ACCOUNT_EMAIL"
      + visibility    = "all"
    }

  # github_actions_organization_variable.image_syncer_writer_service_account_email will be created
  + resource "github_actions_organization_variable" "image_syncer_writer_service_account_email" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "IMAGE_SYNCER_WRITER_SERVICE_ACCOUNT_EMAIL"
      + visibility    = "all"
    }

  # google_artifact_registry_repository_iam_member.image_syncer_prod_repo_reader will be created
  + resource "google_artifact_registry_repository_iam_member" "image_syncer_prod_repo_reader" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = (known after apply)
      + project    = (known after apply)
      + repository = "prod"
      + role       = "roles/artifactregistry.reader"
    }

  # google_artifact_registry_repository_iam_member.image_syncer_prod_repo_writer must be replaced
-/+ resource "google_artifact_registry_repository_iam_member" "image_syncer_prod_repo_writer" {
      ~ etag       = "BwYiB9/6M3o=" -> (known after apply)
      ~ id         = "projects/kyma-project/locations/europe/repositories/prod/roles/artifactregistry.createOnPushWriter/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/attribute.reusable_workflow_run/event_name:push:repository_owner_id:39153523:reusable_workflow_ref:kyma-project/test-infra/.github/workflows/image-syncer.yml@refs/heads/main" -> (known after apply)
      ~ member     = "principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/attribute.reusable_workflow_run/event_name:push:repository_owner_id:39153523:reusable_workflow_ref:kyma-project/test-infra/.github/workflows/image-syncer.yml@refs/heads/main" # forces replacement -> (known after apply) # forces replacement
      ~ project    = "kyma-project" -> (known after apply)
      ~ repository = "projects/kyma-project/locations/europe/repositories/prod" -> "prod"
        # (2 unchanged attributes hidden)
    }

  # google_service_account.image_syncer_reader will be created
  + resource "google_service_account" "image_syncer_reader" {
      + account_id  = "image-syncer-reader"
      + description = "Service account for image-syncer github reusable workflow called on pull request event."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = "sap-kyma-prow"
      + unique_id   = (known after apply)
    }

  # google_service_account.image_syncer_writer will be created
  + resource "google_service_account" "image_syncer_writer" {
      + account_id  = "image-syncer-writer"
      + description = "Service account for image-syncer github reusable workflow called on push event."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = "sap-kyma-prow"
      + unique_id   = (known after apply)
    }

  # google_service_account.sa_gke_kyma_integration will be updated in-place
  ~ resource "google_service_account" "sa_gke_kyma_integration" {
      ~ description  = "Service account is used by Prow to integrate with GKE. Will be removed with Prow" -> "Service account is used by Prow to integrate with GKE."
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # google_service_account_iam_member.image_syncer_reader_workflow_sa_user will be created
  + resource "google_service_account_iam_member" "image_syncer_reader_workflow_sa_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/attribute.reusable_workflow_run/event_name:pull_request:repository_owner_id:39153523:reusable_workflow_ref:kyma-project/test-infra/.github/workflows/image-syncer.yml@refs/heads/main"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.image_syncer_writer_workflow_sa_user will be created
  + resource "google_service_account_iam_member" "image_syncer_writer_workflow_sa_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/attribute.reusable_workflow_run/event_name:push:repository_owner_id:39153523:reusable_workflow_ref:kyma-project/test-infra/.github/workflows/image-syncer.yml@refs/heads/main"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 8 to add, 2 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11921,"Program":"tfcmt","SHA1":"10d5a2345279e94c9d693b8f46d020e7c09d7ea5","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->